; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v4 ?v5)
             (pred_10 ?v3 ?v13)
             (pred_5 ?v4 ?v13)
             (pred_2 ?v8 ?v4 )
	     (pred_4 ?v4)
             (pred_7 ?v10)
             (pred_8 ?v3)
             (pred_9 ?v13)
             (pred_3 ?v4)
             (pred_12 ?v3)
             (pred_11 ?v4)
             (pred_6 ))



(:action op_3
:parameters (?v11 ?v12 ?v9 ?v6)
:precondition (and (pred_7 ?v11) (pred_7 ?v12) (pred_8 ?v9) (pred_9 ?v6)
          (pred_1 ?v11 ?v12) (pred_10 ?v9 ?v6)
                   (pred_5 ?v12 ?v6) (pred_4 ?v11) 
                   (pred_3 ?v12) (pred_12 ?v9))
:effect (and  (pred_11 ?v12) (not (pred_3 ?v12))))


(:action op_1
:parameters (?v11 ?v1)
:precondition (and (pred_7 ?v11) (pred_7 ?v1)
               (pred_4 ?v11) (pred_1 ?v11 ?v1) (pred_11 ?v1))
:effect (and (pred_4 ?v1) (not (pred_4 ?v11))))

(:action op_2
:parameters (?v11 ?v9)
:precondition (and (pred_7 ?v11) (pred_8 ?v9) 
                  (pred_4 ?v11) (pred_2 ?v9 ?v11) (pred_6 ))
:effect (and (pred_12 ?v9)
   (not (pred_2 ?v9 ?v11)) (not (pred_6 ))))


(:action op_4
:parameters (?v11 ?v2 ?v7)
:precondition (and (pred_7 ?v11) (pred_8 ?v2) (pred_8 ?v7)
                  (pred_4 ?v11) (pred_12 ?v7) (pred_2 ?v2 ?v11))
:effect (and (pred_12 ?v2) (pred_2 ?v7 ?v11)
        (not (pred_12 ?v7)) (not (pred_2 ?v2 ?v11))))

(:action op_5
:parameters (?v11 ?v9)
:precondition (and (pred_7 ?v11) (pred_8 ?v9) 
                  (pred_4 ?v11) (pred_12 ?v9))
:effect (and (pred_6 ) (pred_2 ?v9 ?v11) (not (pred_12 ?v9)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_04 obj_29 obj_06 obj_12 obj_19 obj_09 obj_11 obj_15 obj_16 obj_24 obj_18 obj_02 obj_17 obj_25 obj_22 obj_14 obj_01 obj_31 obj_27 obj_28 obj_13 obj_07 obj_08 obj_05 obj_03
    obj_32 obj_23 obj_10
    obj_30 obj_20 obj_26 obj_21
    )

    (:init
       (pred_6)

       (pred_7 obj_04)
       (pred_7 obj_29)
       (pred_7 obj_06)
       (pred_7 obj_12)
       (pred_7 obj_19)
       (pred_7 obj_09)
       (pred_7 obj_11)
       (pred_7 obj_15)
       (pred_7 obj_16)
       (pred_7 obj_24)
       (pred_7 obj_18)
       (pred_7 obj_02)
       (pred_7 obj_17)
       (pred_7 obj_25)
       (pred_7 obj_22)
       (pred_7 obj_14)
       (pred_7 obj_01)
       (pred_7 obj_31)
       (pred_7 obj_27)
       (pred_7 obj_28)
       (pred_7 obj_13)
       (pred_7 obj_07)
       (pred_7 obj_08)
       (pred_7 obj_05)
       (pred_7 obj_03)
       (pred_9 obj_32)
       (pred_9 obj_23)
       (pred_9 obj_10)
       (pred_8 obj_30)
       (pred_8 obj_20)
       (pred_8 obj_26)
       (pred_8 obj_21)

       (pred_1 obj_04 obj_09)
       (pred_1 obj_04 obj_29)
       (pred_1 obj_29 obj_11)
       (pred_1 obj_29 obj_06)
       (pred_1 obj_29 obj_04)
       (pred_1 obj_06 obj_15)
       (pred_1 obj_06 obj_12)
       (pred_1 obj_06 obj_29)
       (pred_1 obj_12 obj_16)
       (pred_1 obj_12 obj_19)
       (pred_1 obj_12 obj_06)
       (pred_1 obj_19 obj_24)
       (pred_1 obj_19 obj_12)
       (pred_1 obj_09 obj_18)
       (pred_1 obj_09 obj_11)
       (pred_1 obj_09 obj_04)
       (pred_1 obj_11 obj_02)
       (pred_1 obj_11 obj_15)
       (pred_1 obj_11 obj_29)
       (pred_1 obj_11 obj_09)
       (pred_1 obj_15 obj_17)
       (pred_1 obj_15 obj_16)
       (pred_1 obj_15 obj_06)
       (pred_1 obj_15 obj_11)
       (pred_1 obj_16 obj_25)
       (pred_1 obj_16 obj_24)
       (pred_1 obj_16 obj_12)
       (pred_1 obj_16 obj_15)
       (pred_1 obj_24 obj_22)
       (pred_1 obj_24 obj_19)
       (pred_1 obj_24 obj_16)
       (pred_1 obj_18 obj_14)
       (pred_1 obj_18 obj_02)
       (pred_1 obj_18 obj_09)
       (pred_1 obj_02 obj_01)
       (pred_1 obj_02 obj_17)
       (pred_1 obj_02 obj_11)
       (pred_1 obj_02 obj_18)
       (pred_1 obj_17 obj_31)
       (pred_1 obj_17 obj_25)
       (pred_1 obj_17 obj_15)
       (pred_1 obj_17 obj_02)
       (pred_1 obj_25 obj_27)
       (pred_1 obj_25 obj_22)
       (pred_1 obj_25 obj_16)
       (pred_1 obj_25 obj_17)
       (pred_1 obj_22 obj_28)
       (pred_1 obj_22 obj_24)
       (pred_1 obj_22 obj_25)
       (pred_1 obj_14 obj_13)
       (pred_1 obj_14 obj_01)
       (pred_1 obj_14 obj_18)
       (pred_1 obj_01 obj_07)
       (pred_1 obj_01 obj_31)
       (pred_1 obj_01 obj_02)
       (pred_1 obj_01 obj_14)
       (pred_1 obj_31 obj_08)
       (pred_1 obj_31 obj_27)
       (pred_1 obj_31 obj_17)
       (pred_1 obj_31 obj_01)
       (pred_1 obj_27 obj_05)
       (pred_1 obj_27 obj_28)
       (pred_1 obj_27 obj_25)
       (pred_1 obj_27 obj_31)
       (pred_1 obj_28 obj_03)
       (pred_1 obj_28 obj_22)
       (pred_1 obj_28 obj_27)
       (pred_1 obj_13 obj_07)
       (pred_1 obj_13 obj_14)
       (pred_1 obj_07 obj_08)
       (pred_1 obj_07 obj_01)
       (pred_1 obj_07 obj_13)
       (pred_1 obj_08 obj_05)
       (pred_1 obj_08 obj_31)
       (pred_1 obj_08 obj_07)
       (pred_1 obj_05 obj_03)
       (pred_1 obj_05 obj_27)
       (pred_1 obj_05 obj_08)
       (pred_1 obj_03 obj_28)
       (pred_1 obj_03 obj_05)
       (pred_3 obj_29)
       (pred_3 obj_22)
       (pred_3 obj_01)
       (pred_3 obj_27)
       (pred_5  obj_29 obj_32)
       (pred_5  obj_22 obj_23)
       (pred_5  obj_01 obj_10)
       (pred_5  obj_27 obj_23)
       (pred_11 obj_04)
       (pred_11 obj_06)
       (pred_11 obj_12)
       (pred_11 obj_19)
       (pred_11 obj_09)
       (pred_11 obj_11)
       (pred_11 obj_15)
       (pred_11 obj_16)
       (pred_11 obj_24)
       (pred_11 obj_18)
       (pred_11 obj_02)
       (pred_11 obj_17)
       (pred_11 obj_25)
       (pred_11 obj_14)
       (pred_11 obj_31)
       (pred_11 obj_28)
       (pred_11 obj_13)
       (pred_11 obj_07)
       (pred_11 obj_08)
       (pred_11 obj_05)
       (pred_11 obj_03)

       (pred_10  obj_30 obj_32)
       (pred_10  obj_20 obj_23)
       (pred_10  obj_26 obj_10)
       (pred_10  obj_21 obj_32)
       (pred_2 obj_30 obj_19)
       (pred_2 obj_20 obj_04)
       (pred_2 obj_26 obj_05)
       (pred_2 obj_21 obj_15)
       (pred_4 obj_05)
    )

    (:goal (and
       (pred_2 obj_30 obj_17)
    ))
(:constraints
  (always (not (pred_4 obj_12)))
)
)

; plan
1. (op_2 obj_05 obj_26)
   deleted: (pred_2 obj_26 obj_05) (pred_6)
   added: (pred_12 obj_26)
   goals met: 0 of 1
2. (op_1 obj_05 obj_08)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_08)
   goals met: 0 of 1
3. (op_1 obj_08 obj_31)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_31)
   goals met: 0 of 1
4. (op_1 obj_31 obj_17)
   deleted: (pred_4 obj_31)
   added: (pred_4 obj_17)
   goals met: 0 of 1
5. (op_5 obj_17 obj_26)
   deleted: (pred_12 obj_26)
   added: (pred_6) (pred_2 obj_26 obj_17)
   goals met: 0 of 1
6. (op_1 obj_17 obj_15)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_15)
   goals met: 0 of 1
7. (op_1 obj_15 obj_16)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_16)
   goals met: 0 of 1
8. (op_1 obj_16 obj_24)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_24)
   goals met: 0 of 1
9. (op_1 obj_24 obj_19)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_19)
   goals met: 0 of 1
10. (op_2 obj_19 obj_30)
   deleted: (pred_2 obj_30 obj_19) (pred_6)
   added: (pred_12 obj_30)
   goals met: 0 of 1
11. (op_1 obj_19 obj_24)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_24)
   goals met: 0 of 1
12. (op_1 obj_24 obj_16)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_16)
   goals met: 0 of 1
13. (op_1 obj_16 obj_15)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_15)
   goals met: 0 of 1
14. (op_1 obj_15 obj_17)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_17)
   goals met: 0 of 1
15. (op_4 obj_17 obj_26 obj_30)
   deleted: (pred_12 obj_30) (pred_2 obj_26 obj_17)
   added: (pred_12 obj_26) (pred_2 obj_30 obj_17)
   goals met: 1 of 1
